DataProcessors/ElectronicDocumentsExchangeWithBank.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ElectronicDocumentsExchangeWithBank</Name>
			<Comment>Electronic document exchange with the bank</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Bank</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDAgreement</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Statements</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>CompanyAccount</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SendingDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BankStatement</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EDAttachedFiles</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/EDDirections.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>EDDirections</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Incoming</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Intercompany</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Outgoing</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/EDKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>EDKinds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AcceptanceCertificate</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ActCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ActPerformer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RightsDelegationAct</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProductsReturnBetweenCompanies</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BankStatement</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AddData</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProductOrder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QueryStatement</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QueryProbe</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EDReturnQuery</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QueryNightStatements</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EDStateQuery</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationAboutReception</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationOnStatusOfED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ProductsDirectory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>STATEMENT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CorrectiveInvoiceNote</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ResponseToOrder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ComissionGoodsSalesReport</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ComissionGoodsWriteOffReport</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Error</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoodsTransferBetweenCompanies</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PaymentOrder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Confirmation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PriceList</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RandomED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AgreementAboutCostChangeSender</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AgreementAboutCostChangeRecipient</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InvoiceForPayment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerInvoiceNote</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TORG12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TORG12Customer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TORG12Seller</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationAboutClarification</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CancellationOffer</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/EDPackage.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>EDPackage</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CounterpartyResourceAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyResourceAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.EmailAccounts</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PackageFormatVersion</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDPackageFormatVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalUID</Name>
					<Comment>Unique identifier of the object in the external system</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataEncrypted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RFBankClassifier</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Direction</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDDirections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDFSetup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sender</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Recipient</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDFProfileSettings</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDFProfileSettings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EncryptionCertificate</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDExchangeMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDExchangeMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PackageStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDPackagesStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ElectronicDocuments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>OwnerObject</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeleteDataEncrypted</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeleteEncryptionCertificate</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ElectronicDocument</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.EDAttachedFiles</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/DigitalSignaturesAndEncryptionKeyCertificates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>DigitalSignaturesAndEncryptionKeyCertificates</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IssuedToWhom</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>firm</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Surname</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Patronymic</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Position</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WhoIssued</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidUntil</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Signing</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encryption</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Imprint</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CertificateData</Name>
					<Comment>Binary data of the certificate</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Application</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DigitalSignatureAndEncryptionApplications</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Revoked</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EnhancedProtectionPrivateKey</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserNotifiedOnValidityInterval</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RequestStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CertificateIssueRequestState</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RequestContent</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ElectronicDocumentsExchangeWithBank/Forms/PasswordToCertificateQuery/Ext/Form/Module.bsl
#Region CommonUseProceduresAndFunctions

&AtServer
Procedure SetEnabledVisible()
	
	If Parameters.WriteToIB OR TypeOf(SelectedCertificate) = Type("String") Then
		Items.SelectedCertificate.Enabled = False;
		Items.RememberPasswordDuringSession.Enabled = False;
	EndIf;
	
	If ValueIsFilled(SelectedCertificate) Then
		Items.SelectedCertificate.ReadOnly = True;
	EndIf;
	
	If TableED.Count() > 1 Then
		Items.ObjectsForProcessings.Title = NStr("en='List';ru='Списком'");
	EndIf;
	
	Items.ObjectsForProcessings.Visible = (TableED.Count() > 0);
	
EndProcedure

&AtClient
Function PasswordReturnParameters()
	
	ChoiceResult = New Structure;
	
	ChoiceResult.Insert("SelectedCertificate", SelectedCertificate);
	ChoiceResult.Insert("User",        User);
	ChoiceResult.Insert("UserPassword",  UserPassword);
	ChoiceResult.Insert("Comment",         "");
	
	Return ChoiceResult;
	
EndFunction

&AtClient
Procedure ChoiceProcessingCertificate()
	
	If Not ValueIsFilled(SelectedCertificate) Then
		Return;
	EndIf;
	
	Password = Undefined;
	ForSessionPeriod = False;
	PasswordReceived = ElectronicDocumentsServiceClient.CertificatePasswordReceived(SelectedCertificate,
		Password, ForSessionPeriod);
	UserPassword = Password;
	RememberPasswordDuringSession = ForSessionPeriod;
	Items.RememberPasswordDuringSession.Enabled = ForSessionPeriod OR Not PasswordReceived;
	Items.UserPassword.Enabled = Not PasswordReceived;
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

&AtClient
Procedure CommandDone(Command)
	
	// The block check on the occupancy certificate of the DS.
	If Items.Pages.CurrentPage = Items.EnterCertificatePassword
		AND Not ValueIsFilled(SelectedCertificate) Then
		MessageText = ElectronicDocumentsClientServer.GetMessageText("Field", "Filling", "Signature certificate");
		CommonUseClientServer.MessageToUser(MessageText, , "SelectedCertificate");
		Return;
	ElsIf Items.Pages.CurrentPage = Items.EnterLoginAndPassword AND IsBlankString(User) Then
		MessageText = ElectronicDocumentsClientServer.GetMessageText("Field", "Filling", "User");
		CommonUseClientServer.MessageToUser(MessageText, , "User");
		Return;
	EndIf;
	
	HandlePasswordReceipt();
	
EndProcedure

#EndRegion

#Region FieldsFormEventsHandlers

&AtClient
Procedure SelectedCertificateOpen(Item, StandardProcessing)
	
	StandardProcessing = False;
	
	FormParameters = New Structure;
	FormParameters.Insert("Key", SelectedCertificate);
	FormParameters.Insert("ReadOnly", True);
	OpenForm("Catalog.DigitalSignaturesAndEncryptionKeyCertificates.Form.ItemForm", FormParameters, ThisObject);
	
EndProcedure

&AtClient
Procedure SelectedCertificateOnChange(Item)
	
	ChoiceProcessingCertificate();
	RefreshDataRepresentation();
	
EndProcedure

&AtClient
Procedure UserPasswordTextEditEnd(Item, Text, ChoiceData, StandardProcessing)
	
	#If Not WebClient Then
	UserPassword = Text;
	#EndIf
	
EndProcedure

&AtClient
Procedure AuthorizationPasswordTextEditEnd(Item, Text, ChoiceData, StandardProcessing)
	
	#If Not WebClient Then
		UserPassword = Text;
	#EndIf

EndProcedure

&AtClient
Procedure ObjectsForProcessingsClick(Item, StandardProcessing)
	
	StandardProcessing = False;
	
	If TableED.Count() > 1 Then
		StructuresArray = New Array;
		For Each DataRow IN TableED Do
			ParametersStructure = New Structure;
			ParametersStructure.Insert("ElectronicDocument",DataRow.ElectronicDocument);
			ParametersStructure.Insert("EDOwner",         DataRow.EDOwner);
			ParametersStructure.Insert("EDDirection",      PredefinedValue("Enum.EDDirections.Outgoing"));
			StructuresArray.Add(ParametersStructure);
		EndDo;
		EDViewForm = OpenForm("DataProcessor.ElectronicDocuments.Form.ExportedDocumentsListForm",
			New Structure("EDStructure", StructuresArray), ThisObject);
		
	ElsIf TypeOf(TableED[0].EDOwner) = Type("DocumentRef.EDPackage") Then
		
		FormParameters = New Structure;
		FormParameters.Insert("Key",          TableED[0].EDOwner);
		FormParameters.Insert("ReadOnly", True);
		OpenForm("Document.EDPackage.Form.DocumentForm", FormParameters);
	ElsIf TypeOf(TableED[0].EDOwner) = Type("DocumentRef.RandomED") Then
		
		// Open an attachment by the standard mechanism
		FileData = ElectronicDocumentsServiceCallServer.GetFileData(TableED[0].ElectronicDocument,
			UUID);
		AttachedFilesClient.OpenFile(FileData, False);
	Else
		FormParameters = New Structure;
		FormParameters.Insert("ElectronicDocument", TableED[0].ElectronicDocument);
		FormParameters.Insert("EDOwner",          TableED[0].EDOwner);
		OpenForm("DataProcessor.ElectronicDocuments.Form.EDViewImportForm", FormParameters, ThisObject);
	EndIf;
	
EndProcedure

&AtClient
Procedure RememberPasswordDuringSessionOnChange(Item)
	
	If Not Items.UserPassword.Enabled Then
		Items.UserPassword.Enabled = Items.RememberPasswordDuringSession.Enabled
			AND Not RememberPasswordDuringSession;
	EndIf;
	
EndProcedure

#EndRegion

#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// Skipping the initialization to guarantee that the form will be received if the AutoTest parameter is passed.
	If Parameters.Property("AutoTest") Then
		Return;
	EndIf;
	
	OperationKind = Parameters.OperationKind;
	
	If OperationKind = NStr("en='Authentication at the bank server';ru='Аутентификация на сервере банка'") Then
		Title = NStr("en='Enter the authentication data';ru='Введите данные аутентификации'");
		Items.Pages.CurrentPage = Items.EnterLoginAndPassword;
		If TypeOf(Parameters.Map) = Type("Map") AND Parameters.Map.Count() > 0 Then
			For Each KeyAndValue IN Parameters.Map Do
				EDAgreement = KeyAndValue.Key;
			EndDo;
		Else
			Return;
		EndIf;
		
		User = CommonUse.ObjectAttributeValue(EDAgreement, "User");
		
	Else
		If TypeOf(Parameters.Map) = Type("Map") AND Parameters.Map.Count() > 0 Then
			StorageAddress = PutToTempStorage(Parameters.Map, UUID);
			For Each KeyAndValue IN Parameters.Map Do
				Items.SelectedCertificate.ChoiceList.Add(KeyAndValue.Key);
			EndDo;
			If Parameters.Map.Count() > 1 Then
				Items.SelectedCertificate.ListChoiceMode = True;
			Else
				SelectedCertificate = Items.SelectedCertificate.ChoiceList[0].Value;
			EndIf;
		Else
			Return;
		EndIf;
	EndIf;
		
	If TypeOf(Parameters.ObjectsForProcessings) = Type("Array") AND Parameters.ObjectsForProcessings.Count() > 0 Then
		If Parameters.ObjectsForProcessings.Count() = 1 Then
			ElectronicDocument = Parameters.ObjectsForProcessings[0];
			TemplateHyperlink = NStr("en='%1 # %2 date %3';ru='%1 № %2 от %3'");
			EDOwner = Undefined;
			If TypeOf(ElectronicDocument) = Type("DocumentRef.EDPackage") Then
				AttributesStructure = CommonUse.ObjectAttributesValues(ElectronicDocument, "Number, Date");
				HyperlinkText = StringFunctionsClientServer.PlaceParametersIntoString(TemplateHyperlink,
					String(TypeOf(ElectronicDocument)),
					AttributesStructure.Number, Format(AttributesStructure.Date, "DLF=D"));
				AttributesStructure.Insert("EDOwner", ElectronicDocument);
				NewRow = TableED.Add();
				NewRow.ElectronicDocument = ElectronicDocument;
				NewRow.EDOwner          = ElectronicDocument;
			ElsIf TypeOf(ElectronicDocument) = Type("CatalogRef.EDAttachedFiles") Then
				AttributesStructure = CommonUse.ObjectAttributesValues(ElectronicDocument,
					"EDKind, SenderDocumentNumber, SenderDocumentDate, Company,
					|FileOwner, FileDescription, BasicUnitName, Extension");
				If TypeOf(AttributesStructure.FileOwner) = Type("CatalogRef.EDUsageAgreements") Then
					If AttributesStructure.EDKind = Enums.EDKinds.ProductsDirectory Then
						TemplateHyperlink = NStr("en='%1 %2 from %3';ru='%1 %2 от %3'");
						HyperlinkText = StringFunctionsClientServer.PlaceParametersIntoString(TemplateHyperlink,
							AttributesStructure.EDKind, AttributesStructure.Company,
							Format(AttributesStructure.SenderDocumentDate, "DLF=D"));
					ElsIf AttributesStructure.EDKind = Enums.EDKinds.QueryStatement Then
						HyperlinkText = String(ElectronicDocument);
					Else
						HyperlinkText = StringFunctionsClientServer.PlaceParametersIntoString(TemplateHyperlink,
							AttributesStructure.EDKind, AttributesStructure.SenderDocumentNumber,
							Format(AttributesStructure.SenderDocumentDate, "DLF=D"));
					EndIf;
				ElsIf AttributesStructure.EDKind = Enums.EDKinds.RandomED Then
					HyperlinkText = ?(ValueIsFilled(AttributesStructure.FileDescription),
						AttributesStructure.FileDescription, AttributesStructure.Description) + "." + AttributesStructure.Extension;
				ElsIf ElectronicDocumentsServiceCallServer.ThisIsServiceDocument(ElectronicDocument) Then
					OperationKind = NStr("en='Service electronic documents signing';ru='Подписание служебных электронных документов'");
					
					TemplateHyperlink = NStr("en='%1';ru='%1'");
					HyperlinkText = StringFunctionsClientServer.PlaceParametersIntoString(TemplateHyperlink,
						AttributesStructure.EDKind);
				Else
					OwnerAttributes = CommonUse.ObjectAttributesValues(AttributesStructure.FileOwner, "Number, Date");
					HyperlinkText = StringFunctionsClientServer.PlaceParametersIntoString(TemplateHyperlink,
						String(TypeOf(AttributesStructure.FileOwner)),
						OwnerAttributes.Number, Format(OwnerAttributes.Date, "DLF=D"));
				EndIf;
				NewRow = TableED.Add();
				NewRow.ElectronicDocument = ElectronicDocument;
				NewRow.EDOwner          = AttributesStructure.FileOwner;
			EndIf;
		Else
			Map = CommonUse.ObjectAttributeValues(Parameters.ObjectsForProcessings, "FileOwner");
			For Each KeyAndValue IN Map Do
				NewRow = TableED.Add();
				NewRow.ElectronicDocument = KeyAndValue.Key;
				NewRow.EDOwner          = KeyAndValue.Value.FileOwner;
			EndDo;
			TemplateHyperlink = NStr("en='Electronic documents (%1)';ru='Электронные документы (%1)'");
			HyperlinkText = StringFunctionsClientServer.PlaceParametersIntoString(TemplateHyperlink,
				Parameters.ObjectsForProcessings.Count());
		EndIf;
		
		HyperlinkText = CommonUseClientServer.ReplaceProhibitedCharsInFileName(HyperlinkText);
		LabelObjectsForProcessings = HyperlinkText;
	EndIf;
	
	WindowOptionsKey = ?(TableED.Count() > 0, "WithObjects", "WithoutObjects");
	SetEnabledVisible();
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	If Items.SelectedCertificate.ChoiceList.Count() = 1 Then
		ChoiceProcessingCertificate();
	EndIf;
	RefreshDataRepresentation();
	
	If ValueIsFilled(User) Then
		CurrentItem = Items.AuthorizationPassword;
	EndIf;
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtClient
Procedure HandlePasswordReceipt()
	
	If Items.Pages.CurrentPage = Items.EnterCertificatePassword Then
		RetainedKey = SelectedCertificate;
		ValueToStore = UserPassword;
	Else
		RetainedKey = EDAgreement;
		DataAuthorization = New Structure("User, UserPassword", User, UserPassword);
		ValueToStore = DataAuthorization;
	EndIf;
	
	If RememberPasswordDuringSession Then
		ElectronicDocumentsServiceClient.AddPasswordToGlobalVariable(RetainedKey, ValueToStore);
	Else
		ElectronicDocumentsServiceClient.DeletePasswordFromGlobalVariable(RetainedKey);
	EndIf;
	
	Close(PasswordReturnParameters());
	
EndProcedure

#EndRegion

#Region AsynchronousProceduresAndFunctions

&AtClient
Procedure SetBlankPasswordDescription(Response, AdditionalParameters) Export
	
	If Response <> DialogReturnCode.Yes Then
		Return;
	EndIf;

	HandlePasswordReceipt();

EndProcedure

#EndRegion


// Rise { Popov N 2016-05-25
&AtClient
Function RiseGetFormInterfaceClient() Export
	Return RiseGetFormInterface();
EndFunction

&AtServer
Function RiseGetFormInterface()
	Return RiseTranslation.GetFormInterface(ThisForm);
EndFunction
// Rise } Popov N 2016-05-25
